app/controllers/my_threads_controller.rb

SELECT `my_threads`.* FROM `my_threads`
---
  def index
    @my_threads = MyThread.all

INSERT INTO `my_threads` (`created_at`, `title`, `updated_at`) VALUES ('2016-04-26 07:47:25', 'kk', '2016-04-26 07:47:25')
---
  def create

    @my_thread = MyThread.new(title: params[:my_thread][:title])#ハッシュ

    respond_to do |format|
      if @my_thread.save

SELECT  `my_threads`.* FROM `my_threads`  WHERE `my_threads`.`id` = 5 LIMIT 1
---
  def edit
    @my_thread = MyThread.find(params[:id])

SELECT  `my_threads`.* FROM `my_threads`  WHERE `my_threads`.`id` = 5 LIMIT 1
UPDATE `my_threads` SET `title` = 'laa', `updated_at` = '2016-04-30 01:23:45' WHERE `my_threads`.`id` = 5
---
  def update
      @my_thread = MyThread.find(params[:id])
      if @my_thread.update(my_thread_params)

SELECT  `my_threads`.* FROM `my_threads`  WHERE `my_threads`.`id` = 1 LIMIT 1
DELETE FROM `my_threads` WHERE `my_threads`.`id` = 1
---
  def destroy
    @my_thread = MyThread.find(params[:id])
    @my_thread.destroy